CSI API ETABS v1

# cTowerAddNewTower Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int AddNewTower(
    	string TowerName,
    	int NumberStories,
    	double TypicalStoryHeight,
    	double BotttomStoryHeight
    )

    Function AddNewTower (
    	TowerName As String,
    	NumberStories As Integer,
    	TypicalStoryHeight As Double,
    	BotttomStoryHeight As Double
    ) As Integer

    Dim instance As cTower
    Dim TowerName As String
    Dim NumberStories As Integer
    Dim TypicalStoryHeight As Double
    Dim BotttomStoryHeight As Double
    Dim returnValue As Integer

    returnValue = instance.AddNewTower(TowerName,
    	NumberStories, TypicalStoryHeight,
    	BotttomStoryHeight)

    int AddNewTower(
    	String^ TowerName,
    	int NumberStories,
    	double TypicalStoryHeight,
    	double BotttomStoryHeight
    )

    abstract AddNewTower :
            TowerName : string *
            NumberStories : int *
            TypicalStoryHeight : float *
            BotttomStoryHeight : float -> int

#### Parameters

TowerName

    Type: SystemString

NumberStories

    Type: SystemInt32

TypicalStoryHeight

    Type: SystemDouble

BotttomStoryHeight

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cTower Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com